Revit 2027 API
ElectricalAnalyticalNodeType Enumeration
 The type of electrical analytical node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ElectricalAnalyticalNodeType
Public Enumeration ElectricalAnalyticalNodeType
public enum class ElectricalAnalyticalNodeType
type ElectricalAnalyticalNodeType
Members
Member name | Value | Description
Bus | 1 |  Bus
EquipmentLoad | 4 |  Equipment Load
PowerSource | 0 |  Power Source
TransferSwitch | 3 |  Transfer Switch
Transformer | 2 |  Transformer
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace